package chapter21;

//? 컬렉션 프레임워크(Collection FrameWork)
// - 자바 기본 배열의 단점
// - 1. 길이가 제한적
// - 2. 내장 기능이 많지 않음 (메소드 많이 없음)
// - 컬렉션은 배열과 같은 자료구조
// - 다수의 데이터를 다루는 데에 필요한 다양하고 풍부한 클래스 제공
// - 인터페이스와 다형성을 이용한 객체지향적 설계를 통해 표준화되어 있음
// - 사용법 익히기에 편리 & 재사용성 높은 코드 작성 가능

// - JDK 1.2 이전에는 Vector, Hashtable, Properties와 같은 컬렉션 클래스 사용
// - 이후엔 컬렉션 프레임워크가 등장하여 표준화된 방식으로 체계화됨

// * 라이브러리와 프레임워크
// - 라이브러리(Library)
//   : 유용한 기능을 모듈화하여 제공
// - 프레임워크(FrameWork)
//   : 단순히 기능뿐만이 아닌 프로그래밍 방식을 정형화하여 
//     프로그램의 개발 생산성을 높이고 유지보수 용이하게 함

public class Collections {
	
}
